Week 6/day_1/sandwichr_pair_programming/app/controllers/sandwiches_controller.rb

	def index
	  sandwiches = Sandwich.all
---
SELECT "sandwiches".* FROM "sandwiches"

	def show
	  sandwich = Sandwich.find_by(id: params[:id])
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]

def add_ingredient
	sandwich = Sandwich.find_by(id: params[:id])
	ingredient = Ingredient.find_by(id: params[:id_ingredient])
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 2]]