Week 6/day_2/sandwichr_pair_programming/app/controllers/sandwich_views_controller.rb

SELECT  "sandwiches".* FROM "sandwiches" LIMIT 100
---
	def index
		@all_sandwiches = Sandwich.all.limit(100)

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		id = params[:id]
		@sandwich = Sandwich.find_by(id: id)