Week 6/day_1/video_games_tournament/app/controllers/tournaments_controller.rb

  def show
  	all_tournaments = Tournament.all.limit(100)
---
SELECT  "tournaments".* FROM "tournaments" LIMIT 100

  def create
  	new_tournament = Tournament.create(tournament_params)
---
INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Fuck Tournament"], ["created_at", "2016-05-02 19:04:23.037104"], ["updated_at", "2016-05-02 19:04:23.037104"]]